<img src ='Data/sakila ERD.png'>

In [24]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Laspc051140!!@localhost/sakila"

In [25]:
engine = create_engine(connection_str)

In [26]:
create_database(connection_str)

ProgrammingError: (pymysql.err.ProgrammingError) (1007, "Can't create database 'sakila'; database exists")
[SQL: CREATE DATABASE sakila CHARACTER SET = 'utf8']
(Background on this error at: https://sqlalche.me/e/14/f405)

In [27]:
database_exists(connection_str)

True

In [28]:
## Check if database exists, if not, create it
if database_exists(connection_str):
    print('It exists!')
else:
    create_database(connection_str)
    print('Database created!')

It exists!

In [30]:
import pandas as pd
q = """SELECT * FROM actor;"""
pd.read_sql(q, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-14 12:34:33
1           2       NICK      WAHLBERG 2006-02-14 12:34:33
2           3         ED         CHASE 2006-02-14 12:34:33
3           4   JENNIFER         DAVIS 2006-02-14 12:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-14 12:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-14 12:34:33
196       197      REESE          WEST 2006-02-14 12:34:33
197       198       MARY        KEITEL 2006-02-14 12:34:33
198       199      JULIA       FAWCETT 2006-02-14 12:34:33
199       200      THORA        TEMPLE 2006-02-14 12:34:33

[200 rows x 4 columns]

In [31]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

### 1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [32]:
q = '''SELECT cs.first_name, cs.last_name, cs.email, ad.address, c.city 
FROM customer AS cs, city AS c
JOIN address AS ad
ON c.city_id = ad.city_id
WHERE c.city_id = 312;'''
pd.read_sql(q,engine)

,first_name,last_name,email,address,city
0,MARY,SMITH,MARY.SMITH@sakilacustomer.org,548 Uruapan Street,London
1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1497 Yuzhou Drive,London
2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,548 Uruapan Street,London
3,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1497 Yuzhou Drive,London
4,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,548 Uruapan Street,London
...,...,...,...,...,...
1193,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,1497 Yuzhou Drive,London
1194,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,548 Uruapan Street,London
1195,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,1497 Yuzhou Drive,London
1196,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,548 Uruapan Street,London
1197,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,1497 Yuzhou Drive,London

### 2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [34]:
q ="""SELECT fl.title, fl.description, fl.release_year, fl.rating, fl.special_features
FROM film AS fl, category AS ca
WHERE ca.name = 'comedy';"""
pd.read_sql(q,engine)

,title,description,release_year,rating,special_features
0,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,PG,"Deleted Scenes,Behind the Scenes"
1,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,G,"Trailers,Deleted Scenes"
2,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,NC-17,"Trailers,Deleted Scenes"
3,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,G,"Commentaries,Behind the Scenes"
4,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes
...,...,...,...,...,...
995,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,G,"Trailers,Behind the Scenes"
996,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,NC-17,"Trailers,Behind the Scenes"
997,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,NC-17,Deleted Scenes
998,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,R,"Trailers,Deleted Scenes"
999,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,NC-17,"Trailers,Commentaries,Behind the Scenes"

### 3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [35]:
q= """SELECT ac.last_name, fl.title, fl.release_year
FROM film AS fl, actor AS ac
WHERE ac.first_name= 'Johnny' AND ac.last_name = 'Lollobrigida';"""
pd.read_sql(q,engine)

        last_name              title  release_year
0    LOLLOBRIGIDA   ACADEMY DINOSAUR          2006
1    LOLLOBRIGIDA     ACE GOLDFINGER          2006
2    LOLLOBRIGIDA   ADAPTATION HOLES          2006
3    LOLLOBRIGIDA   AFFAIR PREJUDICE          2006
4    LOLLOBRIGIDA        AFRICAN EGG          2006
..            ...                ...           ...
995  LOLLOBRIGIDA     YOUNG LANGUAGE          2006
996  LOLLOBRIGIDA         YOUTH KICK          2006
997  LOLLOBRIGIDA       ZHIVAGO CORE          2006
998  LOLLOBRIGIDA  ZOOLANDER FICTION          2006
999  LOLLOBRIGIDA          ZORRO ARK          2006

[1000 rows x 3 columns]

### 4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [36]:
q= """SELECT ac.first_name, ac.last_name
FROM actor AS ac, film AS fl
WHERE fl.title = 'Bingo Talented';"""
pd.read_sql(q,engine)

    first_name     last_name
0     PENELOPE       GUINESS
1         NICK      WAHLBERG
2           ED         CHASE
3     JENNIFER         DAVIS
4       JOHNNY  LOLLOBRIGIDA
..         ...           ...
195       BELA        WALKEN
196      REESE          WEST
197       MARY        KEITEL
198      JULIA       FAWCETT
199      THORA        TEMPLE

[200 rows x 2 columns]

### 5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount?

In [37]:
q="""SELECT cs.customer_id, AVG(pay.amount) AS avg_amount
FROM payment as pay
JOIN customer AS cs
ON cs.customer_id = pay.customer_id
GROUP BY customer_id
HAVING avg_amount = 2*'avg_amount';"""
pd.read_sql(q,engine)

Empty DataFrame
Columns: [customer_id, avg_amount]
Index: []

### 6. What query wouldf you run to list the first and last name of the 5 customers who have the highest number(count) of paymentd?

In [39]:
q="""SELECT cs.first_name, cs.last_name, COUNT(pay.amount) AS num_payments
FROM payment AS pay
JOIN customer AS cs
ON cs.customer_id = pay.customer_id
GROUP BY cs.first_name, cs.last_name
ORDER BY num_payments DESC
LIMIT 5;"""
pd.read_sql(q,engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41